app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY id DESC LIMIT 40
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 28, 29, 30, 31, 32, 33, 35, 36, 37, 39, 40, 41, 42, 44, 45, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 62, 63, 64, 65, 66, 67, 68, 69, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 86, 87, 88, 89, 90, 91, 92, 94, 96, 97, 98, 100)
SELECT SUM("products"."price") AS sum_id FROM "products"
---
	def index
		@products = Product.includes(:user).first(40)
		@sum_price = Product.sum(:price).to_f

SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
UPDATE "products" SET "price" = 230, "updated_at" = '2014-01-11 03:17:15.650815' WHERE "products"."id" = 1
---
	def update
  	@product = Product.where(:id => params[:id]).first

 		respond_to do |format|
      if @product.update_attributes(params[:product])