app/views/products/index.html.erb

      	<td data-product='<%= product.id %>'>$<%= product.price %></td>
      	<td><%= product.user.name if product.user.present? %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 28, 29, 30, 31, 32, 33, 35, 36, 37, 39, 40, 41, 42, 44, 45, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 62, 63, 64, 65, 66, 67, 68, 69, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 86, 87, 88, 89, 90, 91, 92, 94, 96, 97, 98, 100)

<script type='text/javascript'>
      $(document).ready(function(){
            chart = new Highcharts.Chart({
            chart: {
                renderTo: 'highChartContainer',
                plotBackgroundColor: null,
                plotBorderWidth: null,
                plotShadow: false
            },
            title: {
                text: 'Random products'
            },
            series: [{
                type: 'pie',
                name: 'Product Share',
                data:
                  <%=
                      @products.map do |product|
                        [product.name, product.price/@sum_price]
                      end.to_json.html_safe
                  %>
            }]
---
SELECT "products".* FROM "products"
SELECT SUM("products"."price") AS sum_id FROM "products"